["## Understanding IFC.js\n","🐟🐠🐡\r\nIFC.js is not just a library: it is an ecosystem of libraries and projects that make creating BIM tools trivial. There are two reasons for this modularity:\n","*   To be able to use in our applications only what we need.\n*   To make the library more maintainable.\n","It is important to understand which pieces make it up in order to know what to use in each case. IFC.js is essentially composed of 3 layers, each with a unique responsibility.\n","web-ifc","<div style={{margin: \"1rem 0\"}}>\n  An IFC file parser. It is able to read all information from an IFC, edit it and write new files. It has no 3d viewer, it only works with data.\n</div>\n","<div style={{margin: \"1rem 0\"}} />\n","<div>\n  <b>When to use:</b>\n</div>\n","<div style={{margin: \"1rem 0\"}}>\n  When you want to read or write IFC files without any viewer. This library gives full power over the data, but requires more understanding of the IFC schema to use it.\n</div>\n","<div><b>Depends on: </b>-</div>\n","web-ifc-three","<div style={{ margin: \"1rem 0\" }}>\n  A 3D BIM viewer. It allows to view and navigate the 3d model at 60 fps, select\r\n  elements and easily read all the IFC data to display it to the end user. It is\r\n  the official IFC Loader of three.js.\n</div>\n","<div>\n  <b>When to use:</b>\n</div>\n","<div style={{ margin: \"1rem 0\" }}>\n  When you want to make a BIM viewer for your application and you want to have\r\n  full control over all implemented functionalities.\n</div>\n","<div><b>Depends on: </b>web-ifc</div>\n","web-ifc-viewer","<div style={{ margin: \"1rem 0\" }}>\n  A 3D BIM viewer with many tools and functionalities already implemented\r\n  (section drawings, dimensions, etc.), allowing you to create BIM tools with\r\n  very little effort.\n</div>\n","<div>\n  <b>When to use:</b>\n</div>\n","<div style={{ margin: \"1rem 0\" }}>\n  When you want to create a BIM viewer and you don't want to spend time\r\n  implementing all the model navigation tools you would like to have.\n</div>\n","<div><b>Depends on: </b>web-ifc-three</div>\n"]