["## Introduction\n","⚡\r\nCreating a BIM application with IFC.js is very easy. You can find the complete project of the guide [here](https://github.com/IFCjs/hello-world/tree/main/examples/web-ifc-three/helloworld) and the deployed application [here](https://ifcjs.github.io/hello-world/examples/web-ifc-three/helloworld/). You only need to have <a href=\"https://nodejs.org/en/\">Node.js</a> and any IDE installed to follow the steps below. Also, if you don't have any IFC files to follow along, you can get some [here](https://github.com/IFCjs/test-ifc-files).\n","{\" \"}\n","Using IFC.js requires a basic knowledge of web development (HTML, CSS,\r\nJavaScript) and Three.js. If you have no previous experience with Three.js,\r\nyou should probably look <a href=\"https://threejs.org/manual/\">here</a>.\n","🐣\r\nThis minimal tutorial will be done with Vanilla JavaScript, without using frameworks like React, Vue, Angular, Svelte, etc. However, the same steps can be adapted and applied to any of these use cases.\n","## Setting up the project\n","### Install libraries\n","👩‍🏫\r\nThe first thing to do is to create an empty folder and start a new npm project with the command `npm init`. This will generate a `package.json` file containing some data such as the project name, version, commands and dependencies. In addition, the following dependencies must be installed with npm:\n","📝\r\nThe next step is to create an HTML file named `index.html` as the main document of the application. The HTML will have:\n","*   A **canvas element**, used to render the Three.js scene.\n*   An **input element**, which will open IFC files from our computer to the application.\n*   A **script** referencing a file called `bundle.js`, which is the bundle of the app that we will produce with rollup.\n","### Adding style\n","🎨\r\nThe following CSS file will make the canvas full screen:\n","### Bundling\n","Next, we'll create the rollup configuration file. This file has to be called `rollup.config.js` and includes the reference to the plugins we have previously installed.\n","{\" \"}\n","Rollup?","Rollup is a very popular bundling library. For instance, it's the bundler used\r\nby Three.js. Take a look at the{\" \"}\r\n<a href=\"https://rollupjs.org/guide/en/\">rollup docs</a> to learn more.\n","🎯\r\nAlso, the `package.json` file needs to be modified to contain the commands to control rollup easily. In each command, you'll have to specify the relative path to your rollup configuration file. If we have installed everything correctly, we should see the same dependencies in this file (the version of the libraries may differ).\n","*   `npm run build` will bundle the project and create a file called `bundle.js` in the root directory of the project.\n\n*   `npm run watch` will activate the `watch mode`, updating that file automatically every time we make changes to the code and save it.\n","### WebAssembly\n","📁\r\nThe next thing to do is to copy the `web-ifc.wasm` and `web-ifc-mt.wasm` files to a directory in your project. It can be found in `node_modules\\web-ifc` (or `node_modules\\three\\examples\\jsm\\loaders\\ifc` if you are only using Three's IFCLoader). We can copy them wherever we want; in this example, they will be copied to a folder called wasm in the root directory of the project.\n","These files are necessary because they contain the compiled C++ logic of <a href=\"https://github.com/IFCjs/web-ifc\">web-ifc</a>, which is the parsing core to read and write IFC files with native speed.\n","{\" \"}\n","These files have to be served statically in your application. This might need\r\ndifferent tweaks if you are using frameworks or libraries like React, Angular,\r\nVue or Svelte.\n","## Setting up a 3D scene\n","Finally, we are going to create the JavaScript file to write the code for our application. This file can be located anywhere and have any name, but you must reflect this in the `rollup.config.js`.\n","🧱\r\nWe are going to create a basic 3D scene using Three.js.\n","🌏\r\nTo run the application locally we will need a local server. If you are using VS Code as IDE, one option is to install the [Live Server extension](https://marketplace.visualstudio.com/items?itemName=ritwickdey.LiveServer), which allows us to open an instance of Google Chrome, run our web application and see the changes we make to the code in real-time.\n","## Loading IFC files\n","### Loading user's models\n","🏠\r\nFinally, we will use IFC.js to load IFC files. This can be done by instantiating the loader and creating an event for when the user uploads an IFC file to the HTML input element.\n","🎣\r\nKeep in mind that if you haven't saved the wasm files in the root of served files of the project, you'll need to specify its location with `setWasmPath`. For instance, if we had them stored in a folder called `wasm` contained in a folder called `static` in the root of the project, we would do the following:\n","If you have done everything correctly, you should be able to see something similar to [this](https://ifcjs.github.io/hello-world/examples/web-ifc-three/helloworld/) in your local server. From here, the possibilities are endless.\n","### Loading our models\n","🤔\r\nIn the previous point we saw how to load BIM models directly, and that's great. What if we want to show our BIM models instead of allowing the user to upload theirs? This is very simple. Generally there are two possibilities:\n","*   Having the IFC in the same application where you want to display it.\n*   Having to get it from an external storage service.\n\n    🎩\r\n    In the first case, it is sufficient to reference the URL of the IFC file. That is, its relative path in the application. For example, if the IFC is in a folder called \"models\" in the root of the project, we could load that IFC when starting the application as follows:\n","Getting a file from a remote storage service varies depending on the service\r\nused. However, the logic is the same: get the information, create a URL and\r\npass it as an argument to the IFCLoader.\n","## Conclusion\n","🎉\r\nCongratulations! You have just created your first IFC viewer. Go to the next pages of the docs to find out what else can you do with IFC.js.\n","{\" \"}\n","What else can I do with IFC.js?","This is just the beginning. You can take a look at{\" \"}\r\n<a href=\"https://github.com/IFCjs/web-ifc-viewer\">web-ifc-viewer</a>, which\r\nincludes tools for object selection, changing geometry appearance, section\r\nplanes and much more. You can try it{\" \"}\r\n<a href=\"https://ifcjs.github.io/web-ifc-viewer/example/index\">here</a>.\n"]