["## Join our community\n","🌱 Do you want to **join us in our journey** and be an active part of our BIM & Development learning community? Then this is what you were looking for.\n","If you want to join our development team instead, go to the{\" \"}\r\n<a href=\"https://ifcjs.github.io/info/docs/Contribute\">contribution page</a>.\n","<img src={require(\"@site/static/img/clipart/coffee-mates.png\").default} alt=\"PC image\"></img>","### As an individual\n","🧑 Our patreon system is super simple: you give **$5/month** to the project to help IFC.js keep growing. However, **we don't believe that open source should depend on altruistic donations**. For this reason, all patreons gain access to the following:\n","BIM programming courses for all levels","We have BIM programming courses for all levels. Each course cost $100, but\r\npatreons can access them{\" \"}\n","<a href=\"https://ifcjs.github.io/info/docs/Courses/Getting-started#for-patreons\">\n  at just $25\n</a>\n",".\n","Access to the patreon community","Patreons have access to an exclusive channel where they can ask us questions\r\nand make suggestions directly, as well as meet other active members and\r\ncompanies.\n","Exclusive live webinars and streams","Every week we do exclusive streams for patreons where we do tutorials, live\r\ncoding sessions, interviews and showcase patreon community projects.\n","Our help with your projects","Patreons can ask us for help and advice on their projects. We develop BIM\r\nsoftware every day and will share our experience so patreons can take their\r\nbim software to the next level.\n","Prime access to hackathons","We will organise hackathons with great prizes (in the form of cash and\r\nmerchandising) to which only patrons will have access. We will broadcast these\r\nhackathons on our networks, do interviews and much more.\n","Visibility from our networks","Patreons and the BIM products they develop can use our networks to show their\r\nproducts and expand their network.\n","Merch and perks","Patreons will receive exclusive merchandising gifts exclusive IFC.js\r\nmerchandising and gifts.\n","### As a company\n","👨‍💼 We do have a corporate patreon which is **$50/month**. It offers all the benefits mentioned above, plus:\n","Consulting and prime support","We will share our experience in creating professional BIM tools with your\r\ncompany and help you find the best solution.\n","All courses for free + private webinars","All official IFC.js courses free of charge for all your employees, as well as\r\nexclusive webinars / consulting sessions.\n","Product promotion through our networks","Your brand and BIM applications will be promoted in all our networks,\r\nincluding hackathons and stream interviews.\n","Decission making power","You will have some decision-making power over the bookshop's next steps to\r\nalign them with your business.\n","## Where does my money go?\n","💛 We manage all money through [Open Collective](https://opencollective.com/ifcjs). That means that anyone can see who has put how much money into the project.\n","💵 Every time we want to use that money we will have to upload an invoice that will be published on the same page. That way, **the money is as open as the code**.\n","## Who's in?\n"]